'''
LeetCode: 125
Title: Valid Palindrome
Difficulty: Easy

Topics:
- String
- Two Pointers

Task:
A phrase is a palindrome if, after converting all uppercase letters into lowercase letters
and removing all non-alphanumeric characters, it reads the same forward and backward.
Alphanumeric characters include letters and numbers.
Given a string s, return true if it is a palindrome, or false otherwise.



Example 1:
Input: s = "A man, a plan, a canal: Panama"
Output: true
Explanation: "amanaplanacanalpanama" is a palindrome.

Example 2:
Input: s = "race a car"
Output: false
Explanation: "raceacar" is not a palindrome.

Example 3:
Input: s = " "
Output: true
Explanation: s is an empty string "" after removing non-alphanumeric characters.
Since an empty string reads the same forward and backward, it is a palindrome.


Constraints:
1 <= s.length <= 2 * 10^5
s consists only of printable ASCII characters.

Time Complexity: O(n)
Space Complexity: O(n)

Idea:
Создать новый список, включающий только буквы и цифры в нижнем регистре из входящей строки.
Далее создать два указателя для левого и правого индексов (left_idx и right_idx).
Идти двумя указателями навстречу друг дургу, пока left_idx < right_idx
и сравнивать значения, равноудаленные от начала и конца.
Если на каком-то этапе равноудаленные элементы не совпадают, то сразу вернуть False.
На каждом этапе цикла увеличивать на один left_idx и уменьшать на один right_idx.
После проходения цикла вернуть True, в таком случае все элементы совпали,
а значит строка является палиндромом.

Date: 2026-07-07
'''


class Solution:
    def isPalindrome(self, s: str) -> bool:
        new_s = []
        for char in s:
            if char.isalpha() or char.isdigit():
                new_s.append(char.lower())
        left_idx = 0
        right_idx = len(new_s)-1
        while left_idx < right_idx:
            if new_s[left_idx] != new_s[right_idx]:
                return False
            left_idx += 1
            right_idx -= 1
        return True

if __name__ == "__main__":
    solution = Solution()

    # Example 1
    s = "A man, a plan, a canal: Panama"
    result = solution.isPalindrome(s)
    print(result)
    assert result == True

    # Example 2
    s = "race a car"
    result = solution.isPalindrome(s)
    print(result)
    assert result == False

    # Example 3
    s = " "
    result = solution.isPalindrome(s)
    print(result)
    assert result == True